{"content":[{"Section":"banner","Label":"Title","Content":"Our History","":""},{"Section":"description","Label":"Paragraphs","Content":"JCSC had one important mandate - to practice, promote and teach Jainism. Pathshala was organized to teach children about Jainism and the Jain way of life. Swadhyay classes were initiated to motivate adults to participate in pursuing spiritual knowledge and understanding. \n\nIn 1985, JCSC purchased a parcel of land in the City of Buena Park and built its first Jain Bhavan. The custom-designed Jain Bhavan with a Derasar and an auditorium was inaugurated in July 1988, and it addressed the communities need for organizing religious, cultural, educational and outreach activities at the time.\n\nSince 1988, JCSC membership has grown rapidly to a current count of nearly 1,300 families. Over 350 students attend Pathshala classes which are managed by a team of approximately 90 teachers and volunteers. With such phenomenal growth, a vision to expand the original Jain Bhavan began with the acquisition of several neighboring properties from 1993 to 1998.\n\nIn 1994, JCSC solicited a \"wish list\" from the community for the design of a new facility. Based on suggestions received, JCSC developed a master plan to build a multipurpose Jain Center complex in the following three phases:","":""},{"Section":"phase","Label":"Phase 1","Content":"The Cultural Complex was inaugurated in March 2005. The 62,000 sq ft state-of-the-art facility includes an auditorium, Pathshala and swadhyay rooms, a museum, a commercial- grade kitchen, a dining hall, subterranean parking and an offsite parking lot.\n\nA priceless, 108-year old replica of the Palitana Temple is on display in the main lobby of the Cultural Complex. The assembled structure, weighing in at nearly 10,000 lbs and measured at 15 ft x 20 ft and is 35 ft high is carved out of teakwood. The structure has elaborately carved columns, wall panels, doors, a dome, two curved staircases and two ornate jarukhas (enclosed balconies).","":""},{"Section":"phase","Label":"Phase 2","Content":"In September 2008, the original Jain Bhavan was demolished and a brand new complex was constructed on where the original structure stood. The new 13,000 sq ft facility includes a Derasar (Jinalaya), an Aradhana Hall and an exhibit area.","":""},{"Section":"phase","Label":"Phase 3","Content":"Phase III is to follow and will involve renovating the existing post office building.","":""},{"Section":"phase","Label":"Exterior Architecture:","Content":"The design of the Jain Center was inspired by the ancient Jain temples of Delwada, Ranakpur and Palitana Tirths in India. The exterior of the two buildings is constructed of carved Jesalmer yellow limestone, designed and produced in India. Windows and roof parapets were fabricated locally using a lighter-weight FRP material. Natural stone, including marble and colorful granite, is used extensively throughout the interior.\n\nThe distinctive main entrance of the Religious Complex is made out of carved marble with an ornate jarukha, ornamental columns and two Dwarpals on elephants.","":""}]}