{"committees":[{"Slug":"jaec","Committee Name":"Jain Academic Education Committee (JAEC)","Image 1":"","Image 2":"https://drive.google.com/uc?export=view&id=1D_rrEYx4aJiyhRletUNA-NLerQFrVUjv","Mission":"To promote Jain education among youth.","Group Description":"We organize coaching, guidance, and cultural education sessions.","Activities":"Conduct classes, Provide scholarships, Host competitions","More Details":"JAEC collaborates with schools to offer certified Jain studies programs.","Contact 1 Name":"Priya Shah","Contact 1 Phone":"123-456-7890","Contact 1 Email":"priya.shah@jssd.org"},{"Slug":"jaya","Committee Name":"Jain Association of Young Adults (JAYA)","Image 1":"https://drive.google.com/uc?export=view&id=1D_rrEYx4aJiyhRletUNA-NLerQFrVUjv","Image 2":"https://drive.google.com/uc?export=view&id=1D_rrEYx4aJiyhRletUNA-NLerQFrVUjv","Mission":"The Jain Association of Young Adults (JAYA) is focused on connecting young adults through cultural, religious, and community wide programs to build strong foundation within Jain community of Southern California.","Group Description":"JAYA, an affiliated group of Jain Center of Southern California, is dedicated to connecting Jain Young Adults (ages 25 to 50) who share similar heritage, values, and beliefs. Specifically, the group plans a variety of programs and events throughout the year that foster:","Activities":"Social interaction , Temple-related contribution, Community service","More Details":"JAYA aims to develop feelings of togetherness within young Jains living in Southern California by providing opportunities to interact with others, getting involved in religious and cultural activities, strengthening our roots, and to serve for a greater cause. The success of a community is largely dependent on the youth and hence the vision of JAYA is to harness the potential of young Jain adults through exciting programs in order to build a strong foundation within our community.","Contact 1 Name":"Please contact Vipin Vadecha for any question or information.","Contact 1 Phone":"909-861-2677","Contact 1 Email":"vadechav@gmail.com"},{"Slug":"mahila","Committee Name":"Mahila Mandal","Image 1":"","Image 2":"","Mission":"To strengthen women’s roles in Jain society through education & seva.","Group Description":"Mahila Mandal supports women's events, health awareness, and prayer sessions.","Activities":"Host bhakti events, Run health camps, Publish cookbooks","More Details":"Mahila Mandal also curates Jain recipe books and festive event guides.","Contact 1 Name":"Anjali Desai","Contact 1 Phone":"345-678-9012","Contact 1 Email":"anjali.desai@jssd.org"},{"Slug":"seniors","Committee Name":"Jain Seniors Group","Image 1":"","Image 2":"","Mission":"To create a social, spiritual, and active platform for senior citizens.","Group Description":"The group organizes wellness sessions, local trips, and spiritual discourses.","Activities":"Host yoga sessions, Organize satsangs, Arrange field trips","More Details":"Members regularly participate in inter-temple senior forums.","Contact 1 Name":"Rajesh Patel","Contact 1 Phone":"456-789-0123","Contact 1 Email":"rajesh.patel@jssd.org"},{"Slug":"others","Committee Name":"Other Committees","Image 1":"","Image 2":"","Mission":"To serve unique needs like publications, logistics, and tech.","Group Description":"These groups are the backbone of our digital, event, and content infrastructure.","Activities":"Manage website, Handle logistics, Edit publications","More Details":"Other teams also support backend operations for major JSSD programs and functions.","Contact 1 Name":"Komal Shah","Contact 1 Phone":"567-890-1234","Contact 1 Email":"komal.shah@jssd.org"}]}