{"levels":[{"Level":1,"Title":"Foundation Level","Description":"Intro to Jain principles","Age Group":"5–7 years","Duration":"1 hour","Fees":1500,"Students":15,"Topics Covered":"Namokar Mantra, Jain stories, Ahimsa, Festivals, Breathing","Key Activities ":"Drawing, Chanting, Games","Teachers Note":"Start their Jain journey with fun","Learning Outcome":"Learn basic prayers, respect elders, group activities"},{"Level":2,"Title":"Elementary Level","Description":"Stories of Tirthankaras and basic history","Age Group":"8–9 years","Duration":"1.5 hrs","Fees":1500,"Students":18,"Topics Covered":"Tirthankars, History, 5 Vratas, Festivals, Concepts","Key Activities ":"Storytelling, Role play, Festival celebration","Teachers Note":"Build emotional and moral connection","Learning Outcome":"Identify Jain symbols, understand ahimsa, memorize mantras"}],"lunch":{"Key":"Value","lunch_heading":"Pathshala Lunch","lunch_intro":"Join us for a community lunch after each Pathshala session! It's a wonderful opportunity for students and families to come together, share a meal, and strengthen our community bonds while following Jain dietary principles.","lunch_call":"Every family is encouraged to sponsor a lunch during the year to support our community gathering.","button_one":"Know More","button_two":"Donate","sponsorTitle":"Sponsoring Lunches For Pathshala","sponsorIntro1":"After the Pathshala session for the day is over, the Pathshala Students and their Families can enjoy the Lunch get-together.","sponsorIntro2":"We encourage each Pathshala Student Family to sign-up atleast once during the calendar year for sponsoring the Lunch.","sponsorIntro3":"You can sign up to sponsor lunch as part of the registration process.","sponsorGuidelinesTitle":"Lunch Sponsoring Guidelines","sponsorGuideline1":"Please make sure the food served qualifies jain criteria. Following ingredients must not be used in the items served – root vegetables (e.g. onion, garlic, potatoes, carrots), egg-plant, mushrooms, eggs, gelatin and other non-vegetarian items","sponsorGuideline2":"Please avoid using/serving green vegetables on \"tithi\"","sponsorGuideline3":"Lunch is usually served at noon, so please plan on setting up lunch at around 11:45.","sponsorGuideline4":"Please be mindful that a few pathshala students and members are vegan.","cleanupTitle":"Guidelines for cleaning up after Lunch","cleanupIntro":"We thank the volunteer families for helping with clean up tasks after lunch. The below is a set of guidelines to help with the tasks.","cleanup1":"Cleaning up the dishes (loading in dishwasher).","cleanup2":"If washed manually, dry them with dish cloth.","cleanup3":"Do the necessary kitchen cleaning after doing dishes.","cleanup4":"Vacuuming the dining hall floors, kitchen floors and surfaces.","closeLabel":"Close"}}